Revit 2027 API
CoordinationModelLinkUtils.GetCategoryForReferenceInsideCoordinationModel Method
 Returns the category name for the provided element reference inside the provided Coordination Model instance.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GetCategoryForReferenceInsideCoordinationModel(
	Document document,
	Element coordinationModelInstance,
	Reference reference
)
Public Shared Function GetCategoryForReferenceInsideCoordinationModel (
	document As Document,
	coordinationModelInstance As Element,
	reference As Reference
) As String
public:
static String^ GetCategoryForReferenceInsideCoordinationModel(
	Document^ document,
	Element^ coordinationModelInstance,
	Reference^ reference
)
static member GetCategoryForReferenceInsideCoordinationModel :
        document : Document *
        coordinationModelInstance : Element *
        reference : Reference -> string
Parameters
document Document
 The document.
coordinationModelInstance Element
 The Coordination Model instance element where the provided reference is found.
reference Reference
 The reference to the element inside the provided Coordination Model instance.
Return Value
String
 Returns the category name for the provided reference inside the Coordination Model instance.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- The element coordinationModelInstance was not found in the given document. -or- The provided element is not a Autodesk Docs Coordination Model instance. -or- The provided Reference is not a valid element inside the provided Coordination Model instance.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
See Also
Reference
CoordinationModelLinkUtils Class
Autodesk.Revit.DB.ExternalData Namespace